import numpy as np
import pylab as plt
a=np.linspace(-100,100,11)
s=((len(a))*(len(a)),2)
b=np.zeros(s)
for i in range(len(a)*len(a)):
    for j in range(len(a)*len(a)):
            b[j][1] = a[j%11]
    b[i][0]=a[i//11]
print(b)
# #第一項的x,y
# b[0][0]=a[0]
# b[0][1]=a[0]
# #第二項的x,y
# b[1][0]=a[0]
# b[1][1]=a[1]
# #第三項的x,y
# b[2][0]=a[0]
# b[2][1]=a[2]
# #第四項的x,y
# b[3][0]=a[0]
# b[3][1]=a[3]
# #第五項的x,y
# b[4][0]=a[0]
# b[4][1]=a[4]
# #第六項的x,y
# b[5][0]=a[0]
# b[5][1]=a[5]
# #第七項的x,y
# b[6][0]=a[0]
# b[6][1]=a[6]
# #第八項的x,y
# b[7][0]=a[0]
# b[7][1]=a[7]
# #第九項的x,y
# b[8][0]=a[0]
# b[8][1]=a[8]
# #第十項的x,y
# b[9][0]=a[0]
# b[9][1]=a[9]
# #第十一項的x,y
# b[10][0]=a[0]
# b[10][1]=a[10]
#
# #第十二項的x,y
# b[11][0]=a[1]
# b[11][1]=a[0]
