# print(1)
# print(2)
# print(3)
# print(4)

'''
#range(起始值, 結束值但不包含結束值) : 惰性函數 , 只有一個位置 , 一個一個丟
for i in range(1,101):
    print(i) #要內縮(使用tab鍵) , 才會每一次迴圈都出現
'''

'''
#1+2+3+4+...+100=?
sum=0         #設定初始值
for i in range(1,101):
    sum=sum+i #看不懂? 回想 = 的意義，右邊的值放到左邊
print(sum)    #sum值不斷改變，直到迴圈結束(自1開始到100為止)
              #0+1+2+3+4+...+100=
'''

#通常外迴圈用 i 當變數，內迴圈用 j

#0+1-2+3-4+5-6+7-8+9-10+...-100=?
sumi=0
sumq=0
for i in range(1,100,2):
    sumi=sumi+i
for q in range(2,101,2):
    sumq=sumq+q
print(sumi+sumq)

#0+1+1+2+3+5+8+11+...=?
#0+2+4+8+16+32+...=?
# for-loop 可以做非等差級數的相加減嗎?

#面試的時候會出這一題
#使用最快速的方法計算 1+2+3+...+100 : 比如綠點(iPhone製造廠商)
print((1+100)*100/2) #等同於用公式去算
